_posts/2013-02-21-webqq.html
---
layout: post
title: WebQQ逆向
tags: [security]
---
<div id="outline-container-orgdfae354" class="outline-2">
<h2 id="orgdfae354"><span class="section-number-2">1.</span> 部分参考资料</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Google的关键字 "webqq 协议"，有一篇文章，但是版本旧了，而且在密码生成上没有说明，自己动手。</li>
<li><a href="http://jsbin.com/itiqef/1/edit">http://jsbin.com/itiqef/1/edit</a> 用来调试JS代码的。</li>
</ul>
</div>
</div>
<div id="outline-container-orgd917862" class="outline-2">
<h2 id="orgd917862"><span class="section-number-2">2.</span> 目前的进展:</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgeec34d1" class="outline-3">
<h3 id="orgeec34d1"><span class="section-number-3">2.1.</span> 确定了登陆接口位置:</h3>
<div class="outline-text-3" id="text-2-1">
<p>
GET方法的<a href="https://ssl.ptlogin2.qq.com/login">https://ssl.ptlogin2.qq.com/login</a> ，但是似乎没有使用https协议。
</p>
</div>
<div id="outline-container-orgf306a57" class="outline-4">
<h4 id="orgf306a57"><span class="section-number-4">2.1.1.</span> 可能的分析</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
以下是GET方法中传递的参数。
</p>
<div class="org-src-container">
<pre class="src src-python">    <span class="org-variable-name">action</span><span class="org-operator">=</span>3<span class="org-operator">-</span>22<span class="org-operator">-</span>67651
    <span class="org-variable-name">aid</span><span class="org-operator">=</span>1003903
    <span class="org-variable-name">dumy</span><span class="org-operator">=</span>
    <span class="org-variable-name">fp</span><span class="org-operator">=</span>loginerroralert
    <span class="org-variable-name">from_ui</span><span class="org-operator">=</span>1
    <span class="org-variable-name">g</span><span class="org-operator">=</span>1
    <span class="org-variable-name">h</span><span class="org-operator">=</span>1
    <span class="org-variable-name">js_type</span><span class="org-operator">=</span>0
    <span class="org-variable-name">js_ver</span><span class="org-operator">=</span>10021
    <span class="org-variable-name">login2qq</span><span class="org-operator">=</span>1
<span class="org-comment-delimiter">#</span><span class="org-comment">&#36825;&#20010;&#31614;&#21517;&#21487;&#33021;&#26377;&#20316;&#29992;
</span>    <span class="org-variable-name">login_sig</span><span class="org-operator">=</span>f34BxoLH<span class="org-operator">*</span>o9XFnZJwZA2QPGJ94nQ0aFl55FqbM<span class="org-operator">-</span>a6647vQkl4ZL<span class="org-operator">-</span>QKRtOhe<span class="org-operator">-</span>OSPn
    <span class="org-variable-name">mibao_css</span><span class="org-operator">=</span>m_webqq
<span class="org-comment-delimiter">#</span><span class="org-comment">&#36825;&#20010;&#24212;&#35813;&#26159;md5&#21152;&#23494;&#21518;&#30340;&#29992;&#25143;&#23494;&#30721;,&#20294;&#26159;&#38656;&#35201;&#30693;&#36947;&#23494;&#30721;&#30340;&#36716;&#25442;&#26041;&#27861;
</span>    <span class="org-variable-name">p</span><span class="org-operator">=</span>7BB11BE08A1923E1F2704BFA4D40F6F0
    <span class="org-variable-name">ptlang</span><span class="org-operator">=</span>2052
    <span class="org-variable-name">ptredirect</span><span class="org-operator">=</span>0
    <span class="org-variable-name">pttype</span><span class="org-operator">=</span>1
    <span class="org-variable-name">remember_uin</span><span class="org-operator">=</span>1
    <span class="org-variable-name">t</span><span class="org-operator">=</span>1
<span class="org-comment-delimiter">#</span><span class="org-comment">&#29992;&#25143;qq&#21495;
</span>    <span class="org-variable-name">u</span><span class="org-operator">=</span>569945030
    <span class="org-variable-name">u1</span><span class="org-operator">=</span>http:<span class="org-operator">//</span>web.qq.com<span class="org-operator">/</span>loginproxy.html?<span class="org-variable-name">login2qq</span><span class="org-operator">=</span>1<span class="org-operator">&amp;</span><span class="org-variable-name">webqq_type</span><span class="org-operator">=</span>10
<span class="org-comment-delimiter">#</span><span class="org-comment">&#39564;&#35777;&#30721;
</span>    <span class="org-variable-name">verifycode</span><span class="org-operator">=</span>!QSG
    <span class="org-variable-name">webqq_type</span><span class="org-operator">=</span>10
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org65ab208" class="outline-3">
<h3 id="org65ab208"><span class="section-number-3">2.2.</span> 加密方法定位</h3>
<div class="outline-text-3" id="text-2-2">
<p>
发起登陆请求的代码位置,由Chrome开发者工具完成定位.其中搜索md5,可以找到的代码段,猜测代码加密方法为此,继续查找相关函数.
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">if</span>(C[J].name==<span class="org-string">"p"</span>){
                <span class="org-keyword">var</span> <span class="org-variable-name">M</span>=C.p.value;
                <span class="org-keyword">var</span> <span class="org-variable-name">I</span>=hexchar2bin(md5(M));
                <span class="org-keyword">var</span> <span class="org-variable-name">H</span>=md5(I+pt.uin);
                <span class="org-keyword">var</span> <span class="org-variable-name">G</span>=md5(H+C.verifycode.value.toUpperCase());
                A+=G
}<span class="org-keyword">else</span>{
        <span class="org-keyword">if</span>(C[J].name==<span class="org-string">"u1"</span>||C[J].name==<span class="org-string">"ep"</span>){
                <span class="org-keyword">var</span> <span class="org-variable-name">D</span>=C[J].value;<span class="org-keyword">var</span> <span class="org-variable-name">L</span>=<span class="org-string">""</span>;
                <span class="org-keyword">if</span>(g_appid==<span class="org-string">"1003903"</span>&amp;&amp;B){
                        L=<span class="org-string">/\?/</span>g.test(D)?<span class="org-string">"&amp;"</span>:<span class="org-string">"?"</span>;
                        <span class="org-keyword">var</span> <span class="org-variable-name">F</span>=document.getElementById(<span class="org-string">"webqq_type"</span>).value;
                        L+=<span class="org-string">"login2qq="</span>+B.value+<span class="org-string">"&amp;webqq_type="</span>+F
                }
                A+=encodeURIComponent(D+L)
        }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org91f174d" class="outline-3">
<h3 id="org91f174d"><span class="section-number-3">2.3.</span> 相关函数</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orgcc3faca" class="outline-4">
<h4 id="orgcc3faca"><span class="section-number-4">2.3.1.</span> hexchar2bin</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
动态语言就是这么流氓&#x2026;没辙啊&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">function</span> <span class="org-function-name">hexchar2bin</span>(<span class="org-variable-name">str</span>){
        <span class="org-keyword">var</span> <span class="org-variable-name">arr</span>=[];
        <span class="org-keyword">for</span>(<span class="org-keyword">var</span> <span class="org-variable-name">i</span>=0;i&lt;str.length;i=i+2){
                arr.push(<span class="org-string">"\\x"</span>+str.substr(i,2))}
        arr=arr.join(<span class="org-string">""</span>);
        eval(<span class="org-string">"var temp = '"</span>+arr+<span class="org-string">"'"</span>);
        <span class="org-keyword">return</span> temp}
</pre>
</div>
</div>
</div>
<div id="outline-container-org5f07383" class="outline-4">
<h4 id="org5f07383"><span class="section-number-4">2.3.2.</span> md5</h4>
<div class="outline-text-4" id="text-2-3-2">
<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">chrsz</span>=8;

<span class="org-keyword">function</span> <span class="org-function-name">md5</span>(<span class="org-variable-name">A</span>){
        <span class="org-keyword">return</span> hex_md5(A)}
<span class="org-keyword">function</span> <span class="org-function-name">hex_md5</span>(<span class="org-variable-name">A</span>){<span class="org-keyword">return</span> binl2hex(core_md5(str2binl(A),A.length*chrsz))}
<span class="org-keyword">function</span> <span class="org-function-name">binl2hex</span>(<span class="org-variable-name">C</span>){
        <span class="org-keyword">var</span> <span class="org-variable-name">B</span>=hexcase?<span class="org-string">"0123456789ABCDEF"</span>:<span class="org-string">"0123456789abcdef"</span>;
        <span class="org-keyword">var</span> <span class="org-variable-name">D</span>=<span class="org-string">""</span>;
        <span class="org-keyword">for</span>(<span class="org-keyword">var</span> <span class="org-variable-name">A</span>=0;A&lt;C.length*4;A++){
                D+=B.charAt((C[A&gt;&gt;2]&gt;&gt;((A%4)*8+4))&amp;15)+B.charAt((C[A&gt;&gt;2]&gt;&gt;((A%4)*8))&amp;15)
                }
        <span class="org-keyword">return</span> D}
<span class="org-keyword">function</span> <span class="org-function-name">str2binl</span>(<span class="org-variable-name">D</span>){
  <span class="org-keyword">var</span> <span class="org-variable-name">C</span>=Array();
  <span class="org-keyword">var</span> <span class="org-variable-name">A</span>=(1&lt;&lt;chrsz)-1;
  <span class="org-keyword">for</span>(<span class="org-keyword">var</span> <span class="org-variable-name">B</span>=0;B&lt;D.length*chrsz;B+=chrsz){
    C[B&gt;&gt;5]|=(D.charCodeAt(B/chrsz)&amp;A)&lt;&lt;(B%32);}
  <span class="org-keyword">return</span> C;}
<span class="org-keyword">function</span> <span class="org-function-name">core_md5</span>(<span class="org-variable-name">K</span>,<span class="org-variable-name">F</span>){
        K[F&gt;&gt;5]|=128&lt;&lt;((F)%32);
        K[(((F+64)&gt;&gt;&gt;9)&lt;&lt;4)+14]=F;
        <span class="org-keyword">var</span> <span class="org-variable-name">J</span>=1732584193;
        <span class="org-keyword">var</span> <span class="org-variable-name">I</span>=-271733879;
        <span class="org-keyword">var</span> <span class="org-variable-name">H</span>=-1732584194;
        <span class="org-keyword">var</span> <span class="org-variable-name">G</span>=271733878;
        <span class="org-keyword">for</span>(<span class="org-keyword">var</span> <span class="org-variable-name">C</span>=0;C&lt;K.length;C+=16){
                <span class="org-keyword">var</span> <span class="org-variable-name">E</span>=J;<span class="org-keyword">var</span> <span class="org-variable-name">D</span>=I;<span class="org-keyword">var</span> <span class="org-variable-name">B</span>=H;<span class="org-keyword">var</span> <span class="org-variable-name">A</span>=G;
                J=md5_ff(J,I,H,G,K[C+0],7,-680876936);
                G=md5_ff(G,J,I,H,K[C+1],12,-389564586);
                H=md5_ff(H,G,J,I,K[C+2],17,606105819);
                I=md5_ff(I,H,G,J,K[C+3],22,-1044525330);
                J=md5_ff(J,I,H,G,K[C+4],7,-176418897);
                G=md5_ff(G,J,I,H,K[C+5],12,1200080426);
                H=md5_ff(H,G,J,I,K[C+6],17,-1473231341);
                I=md5_ff(I,H,G,J,K[C+7],22,-45705983);
                J=md5_ff(J,I,H,G,K[C+8],7,1770035416);
                G=md5_ff(G,J,I,H,K[C+9],12,-1958414417);
                H=md5_ff(H,G,J,I,K[C+10],17,-42063);
                I=md5_ff(I,H,G,J,K[C+11],22,-1990404162);
                J=md5_ff(J,I,H,G,K[C+12],7,1804603682);
                G=md5_ff(G,J,I,H,K[C+13],12,-40341101);
                H=md5_ff(H,G,J,I,K[C+14],17,-1502002290);
                I=md5_ff(I,H,G,J,K[C+15],22,1236535329);
                J=md5_gg(J,I,H,G,K[C+1],5,-165796510);
                G=md5_gg(G,J,I,H,K[C+6],9,-1069501632);
                H=md5_gg(H,G,J,I,K[C+11],14,643717713);
                I=md5_gg(I,H,G,J,K[C+0],20,-373897302);
                J=md5_gg(J,I,H,G,K[C+5],5,-701558691);
                G=md5_gg(G,J,I,H,K[C+10],9,38016083);
                H=md5_gg(H,G,J,I,K[C+15],14,-660478335);
                I=md5_gg(I,H,G,J,K[C+4],20,-405537848);
                J=md5_gg(J,I,H,G,K[C+9],5,568446438);
                G=md5_gg(G,J,I,H,K[C+14],9,-1019803690);
                H=md5_gg(H,G,J,I,K[C+3],14,-187363961);
                I=md5_gg(I,H,G,J,K[C+8],20,1163531501);
                J=md5_gg(J,I,H,G,K[C+13],5,-1444681467);
                G=md5_gg(G,J,I,H,K[C+2],9,-51403784);
                H=md5_gg(H,G,J,I,K[C+7],14,1735328473);
                I=md5_gg(I,H,G,J,K[C+12],20,-1926607734);
                J=md5_hh(J,I,H,G,K[C+5],4,-378558);
                G=md5_hh(G,J,I,H,K[C+8],11,-2022574463);
                H=md5_hh(H,G,J,I,K[C+11],16,1839030562);
                I=md5_hh(I,H,G,J,K[C+14],23,-35309556);
                J=md5_hh(J,I,H,G,K[C+1],4,-1530992060);
                G=md5_hh(G,J,I,H,K[C+4],11,1272893353);
                H=md5_hh(H,G,J,I,K[C+7],16,-155497632);
                I=md5_hh(I,H,G,J,K[C+10],23,-1094730640);
                J=md5_hh(J,I,H,G,K[C+13],4,681279174);
                G=md5_hh(G,J,I,H,K[C+0],11,-358537222);
                H=md5_hh(H,G,J,I,K[C+3],16,-722521979);
                I=md5_hh(I,H,G,J,K[C+6],23,76029189);
                J=md5_hh(J,I,H,G,K[C+9],4,-640364487);
                G=md5_hh(G,J,I,H,K[C+12],11,-421815835);
                H=md5_hh(H,G,J,I,K[C+15],16,530742520);
                I=md5_hh(I,H,G,J,K[C+2],23,-995338651);
                J=md5_ii(J,I,H,G,K[C+0],6,-198630844);
                G=md5_ii(G,J,I,H,K[C+7],10,1126891415);
                H=md5_ii(H,G,J,I,K[C+14],15,-1416354905);
                I=md5_ii(I,H,G,J,K[C+5],21,-57434055);
                J=md5_ii(J,I,H,G,K[C+12],6,1700485571);
                G=md5_ii(G,J,I,H,K[C+3],10,-1894986606);
                H=md5_ii(H,G,J,I,K[C+10],15,-1051523);
                I=md5_ii(I,H,G,J,K[C+1],21,-2054922799);
                J=md5_ii(J,I,H,G,K[C+8],6,1873313359);
                G=md5_ii(G,J,I,H,K[C+15],10,-30611744);
                H=md5_ii(H,G,J,I,K[C+6],15,-1560198380);
                I=md5_ii(I,H,G,J,K[C+13],21,1309151649);
                J=md5_ii(J,I,H,G,K[C+4],6,-145523070);
                G=md5_ii(G,J,I,H,K[C+11],10,-1120210379);
                H=md5_ii(H,G,J,I,K[C+2],15,718787259);
                I=md5_ii(I,H,G,J,K[C+9],21,-343485551);
                J=safe_add(J,E);I=safe_add(I,D);H=safe_add(H,B);G=safe_add(G,A)}
        <span class="org-keyword">if</span>(mode==16){
                <span class="org-keyword">return</span> Array(I,H)}
        <span class="org-keyword">else</span>{
                <span class="org-keyword">return</span> Array(J,I,H,G)
                }
        }
<span class="org-keyword">function</span> <span class="org-function-name">safe_add</span>(<span class="org-variable-name">A</span>,<span class="org-variable-name">D</span>){
  <span class="org-keyword">var</span> <span class="org-variable-name">C</span>=(A&amp;65535)+(D&amp;65535);
  <span class="org-keyword">var</span> <span class="org-variable-name">B</span>=(A&gt;&gt;16)+(D&gt;&gt;16)+(C&gt;&gt;16);
  <span class="org-keyword">return</span>(B&lt;&lt;16)|(C&amp;65535);
}
<span class="org-keyword">function</span> <span class="org-function-name">md5_cmn</span>(<span class="org-variable-name">F</span>,<span class="org-variable-name">C</span>,<span class="org-variable-name">B</span>,<span class="org-variable-name">A</span>,<span class="org-variable-name">E</span>,<span class="org-variable-name">D</span>){
  <span class="org-keyword">return</span> safe_add(bit_rol(safe_add(safe_add(C,F),safe_add(A,D)),E),B);}
<span class="org-keyword">function</span> <span class="org-function-name">md5_ff</span>(<span class="org-variable-name">C</span>,<span class="org-variable-name">B</span>,<span class="org-variable-name">G</span>,<span class="org-variable-name">F</span>,<span class="org-variable-name">A</span>,<span class="org-variable-name">E</span>,<span class="org-variable-name">D</span>){
  <span class="org-keyword">return</span> md5_cmn((B&amp;G)|((~B)&amp;F),C,B,A,E,D);}
<span class="org-keyword">function</span> <span class="org-function-name">md5_gg</span>(<span class="org-variable-name">C</span>,<span class="org-variable-name">B</span>,<span class="org-variable-name">G</span>,<span class="org-variable-name">F</span>,<span class="org-variable-name">A</span>,<span class="org-variable-name">E</span>,<span class="org-variable-name">D</span>){<span class="org-keyword">return</span> md5_cmn((B&amp;F)|(G&amp;(~F)),C,B,A,E,D);}
<span class="org-keyword">function</span> <span class="org-function-name">md5_hh</span>(<span class="org-variable-name">C</span>,<span class="org-variable-name">B</span>,<span class="org-variable-name">G</span>,<span class="org-variable-name">F</span>,<span class="org-variable-name">A</span>,<span class="org-variable-name">E</span>,<span class="org-variable-name">D</span>){<span class="org-keyword">return</span> md5_cmn(B^G^F,C,B,A,E,D);}
<span class="org-keyword">function</span> <span class="org-function-name">md5_ii</span>(<span class="org-variable-name">C</span>,<span class="org-variable-name">B</span>,<span class="org-variable-name">G</span>,<span class="org-variable-name">F</span>,<span class="org-variable-name">A</span>,<span class="org-variable-name">E</span>,<span class="org-variable-name">D</span>){<span class="org-keyword">return</span> md5_cmn(G^(B|(~F)),C,B,A,E,D);}
<span class="org-keyword">function</span> <span class="org-function-name">bit_rol</span>(<span class="org-variable-name">A</span>,<span class="org-variable-name">B</span>){<span class="org-keyword">return</span>(A&lt;&lt;B)|(A&gt;&gt;&gt;(32-B));}

<span class="org-keyword">var</span> <span class="org-variable-name">chrsz</span>=8;
<span class="org-keyword">var</span> <span class="org-variable-name">hexcase</span>=1;<span class="org-keyword">var</span> <span class="org-variable-name">b64pad</span>=<span class="org-string">""</span>;<span class="org-keyword">var</span> <span class="org-variable-name">chrsz</span>=8;<span class="org-keyword">var</span> <span class="org-variable-name">mode</span>=32;
<span class="org-keyword">function</span> <span class="org-function-name">str2binl</span>(<span class="org-variable-name">D</span>){
  <span class="org-keyword">var</span> <span class="org-variable-name">C</span>=Array();
  <span class="org-keyword">var</span> <span class="org-variable-name">A</span>=(1&lt;&lt;chrsz)-1;
  <span class="org-keyword">for</span>(<span class="org-keyword">var</span> <span class="org-variable-name">B</span>=0;B&lt;D.length*chrsz;B+=chrsz){
    C[B&gt;&gt;5]|=(D.charCodeAt(B/chrsz)&amp;A)&lt;&lt;(B%32);}
  <span class="org-keyword">return</span> C;}
</pre>
</div>
<p>
当然,最后自己验证的结果就是,算的就是MD5.函数名字没起错,- -!
</p>
</div>
</div>
</div>
<div id="outline-container-orgff761d3" class="outline-3">
<h3 id="orgff761d3"><span class="section-number-3">2.4.</span> 猜测密码转换过程</h3>
<div class="outline-text-3" id="text-2-4">
<p>
基本不用猜了,很明显,从之前的if语句中可以看到转换算法了,但是缺一个pt.uin不知道,找了找,要用这个函数,函数的参数就是uin,其实就是qq号:
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">function</span> <span class="org-function-name">uin2hex</span>(<span class="org-variable-name">str</span>){
  <span class="org-keyword">var</span> <span class="org-variable-name">maxLength</span>=16;
  str=parseInt(str);
  <span class="org-keyword">var</span> <span class="org-variable-name">hex</span>=str.toString(16);
  <span class="org-keyword">var</span> <span class="org-variable-name">len</span>=hex.length;
  <span class="org-keyword">for</span>(<span class="org-keyword">var</span> <span class="org-variable-name">i</span>=len;i&lt;maxLength;i++){hex=<span class="org-string">"0"</span>+hex;}
  <span class="org-keyword">var</span> <span class="org-variable-name">arr</span>=[];
  <span class="org-keyword">for</span>(<span class="org-keyword">var</span> <span class="org-variable-name">j</span>=0;j&lt;maxLength;j+=2){arr.push(<span class="org-string">"\\x"</span>+hex.substr(j,2));}
  <span class="org-keyword">var</span> <span class="org-variable-name">result</span>=arr.join(<span class="org-string">""</span>);
  eval(<span class="org-string">'result="'</span>+result+<span class="org-string">'"'</span>);
  <span class="org-keyword">return</span> result;}
</pre>
</div>
<p>
综上,md5混合着用户密码、用户qq号、验证码生成最后上传用于验证的加密后密码.
</p>
</div>
</div>
<div id="outline-container-org8bc5318" class="outline-3">
<h3 id="org8bc5318"><span class="section-number-3">2.5.</span> <span class="todo TODO">TODO</span> 进一步的其他待猜测的数据</h3>
<div class="outline-text-3" id="text-2-5">
<p>
拼图上还缺的一些东西：
</p>
<ul class="org-ul">
<li>cookie中的内容的作用，不过考虑到在登录前cookie貌似没什么用，所以cookie应该就是意思意思，接受下服务器内容就没了。</li>
<li>那个GET方法中的什么什么sig，怎么弄来的？</li>
</ul>
</div>
</div>
</div>
